stm32-rs/stm32f4xx-hal/src/serial.rs
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART8> for NoTx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART8> for NoRx {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinTx<UART8> for PE1<Alternate<AF8>> {}
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl PinRx<UART8> for PE0<Alternate<AF8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART8> for PF9<Alternate<AF8>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART8> for PF8<Alternate<AF8>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART9> for NoTx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART9> for NoRx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART9> for PD15<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART9> for PD14<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART9> for PG1<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART9> for PG0<Alternate<AF11>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART10> for NoTx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART10> for NoRx {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART10> for PE3<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART10> for PE2<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinTx<UART10> for PG12<Alternate<AF11>> {}
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
impl PinRx<UART10> for PG11<Alternate<AF11>> {}

/// Serial abstraction
pub struct Serial<USART, PINS> {
    usart: USART,
    pins: PINS,
}

/// Serial receiver
pub struct Rx<USART> {
    _usart: PhantomData<USART>,
}

/// Serial transmitter
pub struct Tx<USART> {
    _usart: PhantomData<USART>,
}

macro_rules! halUsartImpl {
    ($(
        $USARTX:ident: ($usartX:ident, $apbXenr:ident, $rcc_bit:expr, $usartXen:ident, $pclkX:ident),
    )+) => {
        $(
            impl<PINS> Serial<$USARTX, PINS> {
                pub fn $usartX(
                    usart: $USARTX,
                    pins: PINS,
                    config: config::Config,
                    clocks: Clocks,
                ) -> Result<Self, config::InvalidConfig>
                where
                    PINS: Pins<$USARTX>,
                {
                    use self::config::*;
                    use crate::bb;

                    unsafe {
                        // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
                        let rcc = &(*RCC::ptr());

                        // Enable clock.
                        bb::set(&rcc.$apbXenr, $rcc_bit);
                    }

                    let pclk_freq = clocks.$pclkX().0;
                    let baud = config.baudrate.0;

                    // The frequency to calculate USARTDIV is this:
                    //
                    // (Taken from STM32F411xC/E Reference Manual,
                    // Section 19.3.4, Equation 1)
                    //
                    // 16 bit oversample: OVER8 = 0
                    // 8 bit oversample:  OVER8 = 1
                    //
                    // USARTDIV =          (pclk)
                    //            ------------------------
                    //            8 x (2 - OVER8) x (baud)
                    //
                    // BUT, the USARTDIV has 4 "fractional" bits, which effectively
                    // means that we need to "correct" the equation as follows:
                    //
                    // USARTDIV =      (pclk) * 16
                    //            ------------------------
                    //            8 x (2 - OVER8) x (baud)
                    //
                    // When OVER8 is enabled, we can only use the lowest three
                    // fractional bits, so we'll need to shift those last four bits
                    // right one bit

                    // Calculate correct baudrate divisor on the fly
                    let (over8, div) = if (pclk_freq / 16) >= baud {
                        // We have the ability to oversample to 16 bits, take
                        // advantage of it.
                        //
                        // We also add `baud / 2` to the `pclk_freq` to ensure
                        // rounding of values to the closest scale, rather than the
                        // floored behavior of normal integer division.
                        let div = (pclk_freq + (baud / 2)) / baud;
                        (false, div)
                    } else if (pclk_freq / 8) >= baud {
                        // We are close enough to pclk where we can only
                        // oversample 8.
                        //
                        // See note above regarding `baud` and rounding.
                        let div = ((pclk_freq * 2) + (baud / 2)) / baud;

                        // Ensure the the fractional bits (only 3) are
                        // right-aligned.
                        let frac = (div & 0xF);
                        let div = (div & !0xF) | (frac >> 1);
                        (true, div)
                    } else {
                        return Err(config::InvalidConfig)
                    };

                    usart.brr.write(|w| unsafe {
                        w.bits(div)
                    });

                    // Reset other registers to disable advanced USART features
                    usart.cr2.reset();
                    usart.cr3.reset();

